reports/climbingWallSPA.org
#+TITLE: Climbing Wall Route Annotation SPA
#+DATE: <2017-11-19 Sun>
#+OPTIONS: toc:nil num:nil
#+CREATOR:

* What
  The Climbing Wall (TCW) has routes densily packed through different areas.
 To track our effort, we 1) identify the route and 2) annotate our progress.
 
** identify
   Some routes have names. Most routes have the setter's initials. All routes have a color and grading (VB-V9).
   Colors are repeated in different areas and occasionally within in an area, but the combined area, color, and difficulty should uniquely identify each route.
   
** annotate
   We might care about
- fun factor (e.g. stars)
- precieved difficultly (within grade): easy,expected,hard
- flashed/onsite, completed, in-progress (% done?), skipped
- last attempt (day + % complete)

** limitation's of org-mode tangle
   - line number error messages mean nothing
   - quick edits are hard, collaboration is near impossible
* Code

