hugo/public/climbingwallspa/index.html
<!DOCTYPE html>
<html>
  <head>
    <title>Climbing Wall Route Annotation SPA</title>
    <link rel="stylesheet" type="text/css" href="/css/style.css" />
    <link rel="alternate" type="application/rss+xml" title="WFLOG RSS Feed" href="index.xml" />
    <link rel="shortcut icon" href="https://secure.gravatar.com/avatar/3fed911ae9175eaf6c4e4ec51de7e6ac?size=125">
  </head>
  <body style="max-width: 40em">

    <h1 style="font-size:bigger">Climbing Wall Route Annotation SPA</h1>
    <div class="content">
      
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
What
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>The Climbing Wall (TCW) has routes densily packed through different areas.
 To track our effort, we 1) identify the route and 2) annotate our progress.</p>
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
identify
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Some routes have names. Most routes have the setter&#39;s initials. All routes have a color and grading (VB-V9).
   Colors are repeated in different areas and occasionally within in an area, but the combined area, color, and difficulty should uniquely identify each route.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-3">
<h3 id="headline-3">
annotate
</h3>
<div id="outline-text-headline-3" class="outline-text-3">
<p>We might care about</p>
<ul>
<li>fun factor (e.g. stars)</li>
<li>precieved difficultly (within grade): easy,expected,hard</li>
<li>flashed/onsite, completed, in-progress (% done?), skipped</li>
<li>last attempt (day + % complete)</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
limitation&#39;s of org-mode tangle
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<ul>
<li>line number error messages mean nothing</li>
<li>quick edits are hard, collaboration is near impossible</li>
</ul>
</div>
</div>
</div>
</div>
