hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
Code
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
The html for the SPA only calls javascript (which among other things, inserts the svg
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<div class="src src-html">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-html" data-lang="html"><span style="display:flex;"><span>&lt;<span style="color:#f92672">html</span>&gt;
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">head</span>&gt;
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">title</span>&gt; TCW Route Tracker &lt;/<span style="color:#f92672">title</span>&gt;
</span></span><span style="display:flex;"><span><span style="color:#75715e">&lt;!--
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">&lt;script src=&#34;https://unpkg.com/vue&#34;&gt;&lt;/script&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">&lt;script src=&#34;https://d3js.org/d3.v4.min.js&#34;&gt;&lt;/script&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">--&gt;</span>
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">script</span> <span style="color:#a6e22e">src</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;vue&#34;</span>&gt;&lt;/<span style="color:#f92672">script</span>&gt;
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">script</span> <span style="color:#a6e22e">src</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;d3.v4.min.js&#34;</span>&gt;&lt;/<span style="color:#f92672">script</span>&gt;
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">link</span> <span style="color:#a6e22e">rel</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;stylesheet&#34;</span> <span style="color:#a6e22e">href</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;style.css&#34;</span>&gt; &lt;/<span style="color:#f92672">style</span>&gt;
</span></span><span style="display:flex;"><span>&lt;/<span style="color:#f92672">head</span>&gt;
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">body</span>&gt; 
</span></span><span style="display:flex;"><span><span style="color:#75715e">&lt;!-- vue --&gt;</span>
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;climbing_spa&#34;</span>&gt;
</span></span><span style="display:flex;"><span> &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;who-are-we&#34;</span>&gt;
</span></span><span style="display:flex;"><span> logging as {{current.climber}} &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;clickable&#34;</span> <span style="color:#a6e22e">v-on:click</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;setClimber(null)&#34;</span>&gt;change&lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span> &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span> &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;route_specification&#34;</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span> <span style="color:#75715e">&lt;!-- to submit: route status and specific info --&gt;</span> 
</span></span><span style="display:flex;"><span>   &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">v-on:click</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;reset_current()&#34;</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;clickable&#34;</span> <span style="color:#a6e22e">v-show</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;have_any_current&#34;</span>&gt; x &lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span>   <span style="color:#75715e">&lt;!--  debug v-if displays
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   all: {{have_all_current}} &lt;br&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   any: {{have_any_current}} &lt;br&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   {{current.area  != null }} {{current.color != null }} {{current_grade != null}}
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   &lt;br&gt; current_grade: {{ current_grade }} | {{current.grade_full}} + {{current.plus_half}}
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">    --&gt;</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>   &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current&#34;</span> <span style="color:#a6e22e">v-show</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;have_all_current&#34;</span>&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;route_id&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>     {{current.color}} {{grade_combined()}} on {{current.area}} 
</span></span><span style="display:flex;"><span>    &lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">br</span> /&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">select</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.status&#34;</span> &gt;
</span></span><span style="display:flex;"><span>     &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">value</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> <span style="color:#a6e22e">disabled</span> <span style="color:#a6e22e">selected</span>&gt;status&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>     &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;s in options.status&#34;</span> &gt;{{s}}&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>    &lt;/<span style="color:#f92672">select</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">select</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.rate&#34;</span> &gt;
</span></span><span style="display:flex;"><span>     &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">value</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> <span style="color:#a6e22e">disabled</span> <span style="color:#a6e22e">selected</span>&gt;rate&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>     &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;r in options.ratings&#34;</span>&gt;{{r}}&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>    &lt;/<span style="color:#f92672">select</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">input</span> <span style="color:#a6e22e">type</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;text&#34;</span> <span style="color:#a6e22e">placeholder</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;notes&#34;</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.note&#34;</span> /&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">br</span> /&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">input</span> <span style="color:#a6e22e">type</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;text&#34;</span> <span style="color:#a6e22e">placeholder</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;setter&#34;</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.setter&#34;</span> <span style="color:#a6e22e">size</span><span style="color:#f92672">=</span><span style="color:#e6db74">3</span> /&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">input</span> <span style="color:#a6e22e">type</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;text&#34;</span> <span style="color:#a6e22e">placeholder</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;00/00&#34;</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.set_date&#34;</span> <span style="color:#a6e22e">size</span><span style="color:#f92672">=</span><span style="color:#e6db74">5</span> /&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">input</span> <span style="color:#a6e22e">type</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;text&#34;</span> <span style="color:#a6e22e">placeholder</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;name&#34;</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.name&#34;</span> /&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    &lt;/<span style="color:#f92672">br</span>&gt;
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">button</span> <span style="color:#a6e22e">v-on:click</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;addCurrent()&#34;</span> <span style="color:#a6e22e">v-show</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.status&#34;</span>&gt;Add&lt;/<span style="color:#f92672">button</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">&lt;!-- 3 piece identification --&gt;</span> 
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;id-current&#34;</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;<span style="color:#f92672">select</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.color&#34;</span> &gt;
</span></span><span style="display:flex;"><span>       &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">value</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> <span style="color:#a6e22e">disabled</span> <span style="color:#a6e22e">selected</span>&gt;color&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>       &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;g in options.color&#34;</span> <span style="color:#a6e22e">v-bind:style</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;{color: g}&#34;</span>&gt;{{g}}&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;/<span style="color:#f92672">select</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>   &lt;<span style="color:#f92672">select</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.grade_full&#34;</span> &gt;
</span></span><span style="display:flex;"><span>       &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">value</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> <span style="color:#a6e22e">disabled</span> <span style="color:#a6e22e">selected</span>&gt;grade&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>       &lt;<span style="color:#f92672">option</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;g in options.grade&#34;</span>&gt;{{g}}&lt;/<span style="color:#f92672">option</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;/<span style="color:#f92672">select</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>   &lt;<span style="color:#f92672">input</span> <span style="color:#a6e22e">type</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;checkbox&#34;</span> <span style="color:#a6e22e">name</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;plus_half&#34;</span> <span style="color:#a6e22e">v-model</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;current.plus_half&#34;</span> /&gt; +1/2?
</span></span><span style="display:flex;"><span>  &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span>  
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">&lt;!-- &#34;fancier&#34; select
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">    -- select grade as as radio buttons
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">  &lt;ul class=&#34;color-buttons&#34;&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">    &lt;li v-for=&#34;c in options.color&#34; v-bind:class=&#34;{&#39;box-selected&#39;: c == current.color }&#34; v-bind:style=&#34;{ background: c}&#34; @click=&#34;current.color = c&#34; v-bind:title=&#34;c&#34; &gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">    &lt;/li&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">  &lt;/ul&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">  &lt;ul class=&#34;grade-select&#34;&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   &lt;li v-for=&#34;g in options.grade&#34;&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">     &lt;input type=&#34;radio&#34; name=&#34;grade&#34; :value=&#34;g&#34; v-model=&#34;current.grade_full&#34; /&gt;&lt;br/&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">    {{g}} 
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">     &lt;/li&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">   &lt;li&gt;&lt;input type=&#34;checkbox&#34; name=&#34;plus_half&#34; v-model=&#34;current.plus_half&#34; /&gt; &lt;br /&gt; +1/2?&lt;/li&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">  &lt;/ul&gt;
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">  --&gt;</span>
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;climbingAreas&#34;</span>&gt; &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span> &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span> &lt;<span style="color:#f92672">div</span> <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;list&#34;</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">&lt;!--  summary list --&gt;</span>
</span></span><span style="display:flex;"><span>  &lt;<span style="color:#f92672">ul</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;route_list&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">li</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;r in route_summaries&#34;</span>  <span style="color:#a6e22e">v-if</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;matches_current(r)&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">v-on:click</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;setCurrent(r)&#34;</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;info&#34;</span>&gt;
</span></span><span style="display:flex;"><span>       {{r.area}} {{r.color}} {{r.grade}} 
</span></span><span style="display:flex;"><span>      &lt;/<span style="color:#f92672">span</span>&gt; 
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">br</span> /&gt;
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;info_minor&#34;</span>&gt;
</span></span><span style="display:flex;"><span>       {{r.name}} {{r.setter}} {{r.set_date}}
</span></span><span style="display:flex;"><span>      &lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;stats&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>       | {{r.cnt}} {{r.avgrank}} ( {{r.recent}} )
</span></span><span style="display:flex;"><span>      &lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;/<span style="color:#f92672">li</span>&gt;
</span></span><span style="display:flex;"><span>  &lt;/<span style="color:#f92672">ul</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  &lt;<span style="color:#f92672">hr</span> <span style="color:#a6e22e">v-show</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;allroutes.length &gt; 0&#34;</span>&gt;
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">&lt;!--  raw list --&gt;</span>
</span></span><span style="display:flex;"><span>  &lt;<span style="color:#f92672">ul</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;route_list&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>    &lt;<span style="color:#f92672">li</span> <span style="color:#a6e22e">v-for</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;r in allroutes&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">v-on:click</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;setCurrent(r)&#34;</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;info&#34;</span>&gt;
</span></span><span style="display:flex;"><span>       {{r.area}} {{r.color}} {{r.grade}} 
</span></span><span style="display:flex;"><span>      &lt;/<span style="color:#f92672">span</span>&gt;  &lt;<span style="color:#f92672">br</span>&gt;
</span></span><span style="display:flex;"><span>      &lt;<span style="color:#f92672">span</span> <span style="color:#a6e22e">class</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;person&#34;</span>&gt; 
</span></span><span style="display:flex;"><span>       {{r.climber}} {{r.status}} @ {{r.timestamp}}
</span></span><span style="display:flex;"><span>      &lt;/<span style="color:#f92672">span</span>&gt;
</span></span><span style="display:flex;"><span>   &lt;/<span style="color:#f92672">li</span>&gt;
</span></span><span style="display:flex;"><span>  &lt;/<span style="color:#f92672">ul</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span> &lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span>&lt;/<span style="color:#f92672">div</span>&gt;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">&lt;!-- d3 select area --&gt;</span>
</span></span><span style="display:flex;"><span>&lt;<span style="color:#f92672">script</span> <span style="color:#a6e22e">src</span><span style="color:#f92672">=</span><span style="color:#e6db74">&#34;climbarea.js&#34;</span>&gt; &lt;/<span style="color:#f92672">script</span>&gt;
</span></span><span style="display:flex;"><span>&lt;/<span style="color:#f92672">body</span>&gt;
</span></span><span style="display:flex;"><span>&lt;/<span style="color:#f92672">html</span>&gt;</span></span></code></pre></div>
</div>
