hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-7" class="outline-4">
<h4 id="headline-7">
style
</h4>
<div id="outline-text-headline-7" class="outline-text-4">
<div class="src src-css">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-css" data-lang="css"><span style="display:flex;"><span>.<span style="color:#a6e22e">clickable</span> { <span style="color:#66d9ef">cursor</span>: <span style="color:#66d9ef">pointer</span>;  }
</span></span><span style="display:flex;"><span>#current { <span style="color:#66d9ef">border</span>: <span style="color:#66d9ef">solid</span> <span style="color:#66d9ef">black</span> <span style="color:#ae81ff">1</span><span style="color:#66d9ef">px</span>; <span style="color:#66d9ef">padding</span>: <span style="color:#ae81ff">5</span><span style="color:#66d9ef">px</span>;}
</span></span><span style="display:flex;"><span>#id-current {<span style="color:#66d9ef">padding</span>: <span style="color:#ae81ff">1</span><span style="color:#66d9ef">em</span>}
</span></span><span style="display:flex;"><span><span style="color:#75715e">/* ul/li setting for color buttons is the only real meaningful css setting 
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"> * all other elements will display in a functioning way with css */</span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">ul</span> { 
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">list-style</span>: <span style="color:#66d9ef">none</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>.<span style="color:#a6e22e">grade-select</span> <span style="color:#f92672">&gt;</span><span style="color:#f92672">li</span> { <span style="color:#66d9ef">display</span>: <span style="color:#66d9ef">inline-block</span>; <span style="color:#66d9ef">text-align</span>:<span style="color:#66d9ef">center</span>}
</span></span><span style="display:flex;"><span>.<span style="color:#a6e22e">color-buttons</span><span style="color:#f92672">&gt;</span><span style="color:#f92672">li</span> { 
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">display</span>: <span style="color:#66d9ef">inline-block</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">width</span>: <span style="color:#ae81ff">20</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">height</span>:<span style="color:#ae81ff">20</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">margin-right</span>: <span style="color:#ae81ff">10</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">border</span>: <span style="color:#66d9ef">solid</span> <span style="color:#66d9ef">black</span> <span style="color:#ae81ff">2</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">cursor</span>: <span style="color:#66d9ef">pointer</span>; }
</span></span><span style="display:flex;"><span>.<span style="color:#a6e22e">box-selected</span> {
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">border-color</span>: <span style="color:#66d9ef">red</span> <span style="color:#75715e">!important</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">/* left side */</span>
</span></span><span style="display:flex;"><span>#route_specification {
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">display</span>: <span style="color:#66d9ef">inline-block</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">width</span>: <span style="color:#ae81ff">400</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>#current <span style="color:#f92672">&gt;</span> <span style="color:#f92672">span</span>.<span style="color:#a6e22e">route_id</span> {
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">display</span>: <span style="color:#66d9ef">block</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e">/* right side */</span>
</span></span><span style="display:flex;"><span>#list {
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">display</span>: <span style="color:#66d9ef">inline-block</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">vertical-align</span>: <span style="color:#66d9ef">top</span>
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#75715e">/* display submited route statuses */</span>
</span></span><span style="display:flex;"><span><span style="color:#f92672">ul</span>.<span style="color:#a6e22e">route_list</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">li</span> {
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">padding</span>: <span style="color:#ae81ff">.2</span><span style="color:#66d9ef">em</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">padding-bottom</span>: <span style="color:#ae81ff">1</span><span style="color:#66d9ef">em</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#f92672">ul</span>.<span style="color:#a6e22e">route_list</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">li</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">span</span>.<span style="color:#a6e22e">info</span> {
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">background-color</span>: <span style="color:#66d9ef">lightblue</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">margin-right</span>: <span style="color:#ae81ff">1</span><span style="color:#66d9ef">em</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">cursor</span>: <span style="color:#66d9ef">pointer</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">margin-bottom</span>: <span style="color:#66d9ef">solid</span> <span style="color:#66d9ef">darkblue</span> <span style="color:#ae81ff">1</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">border-bottom</span>: <span style="color:#66d9ef">dashed</span> <span style="color:#66d9ef">black</span> <span style="color:#ae81ff">1</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#f92672">ul</span>.<span style="color:#a6e22e">route_list</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">li</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">span</span>.<span style="color:#a6e22e">info</span>:<span style="color:#a6e22e">hover</span><span style="color:#f92672">,</span> <span style="color:#f92672">ul</span>.<span style="color:#a6e22e">route_list</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">li</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">span</span>.<span style="color:#a6e22e">info</span>:<span style="color:#a6e22e">active</span> {
</span></span><span style="display:flex;"><span> <span style="color:#66d9ef">background-color</span>: <span style="color:#66d9ef">lightgreen</span>
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#f92672">ul</span>.<span style="color:#a6e22e">route_list</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">li</span> <span style="color:#f92672">&gt;</span> <span style="color:#f92672">span</span>.<span style="color:#a6e22e">person</span> {
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">font-size</span>: <span style="color:#ae81ff">6</span><span style="color:#66d9ef">pt</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">background-color</span>: <span style="color:#66d9ef">gray</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">border-radius</span>: <span style="color:#ae81ff">5</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">border</span>: <span style="color:#66d9ef">solid</span> <span style="color:#66d9ef">black</span> <span style="color:#ae81ff">1</span><span style="color:#66d9ef">px</span>;
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">padding</span>: <span style="color:#ae81ff">.2</span><span style="color:#66d9ef">em</span>;
</span></span><span style="display:flex;"><span>}</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
