reports/climbingWallSPA.org
*** model
    what do we want to track, what color, grade, and status options are allowed
 #+BEGIN_SRC javascript :tangle climbarea.js :exports code
 var empty_route_info = {
  'area': null,
  'set_date': null,
  'setter': null,
  'name': null,
  //status and rate are dropdowns
  // must be "" instead of null so dropbox selects it
  'grade_full': "", 
  'status': "", 
  'rate': "",
  'color': "", 
  'note': null,
  'location': 'TCW_boulder',
  'climber': null
 }
 var model = 
  {'current': JSON.parse(JSON.stringify(empty_route_info)),
   'options': {
     'status': ['on-sight','completed','peiced','75%','50%','25%','started','skipped'],
     'color':  ['red','orange','yellow','green','blue','pink','black','white','stripped','rainbow','graphic'],
     'grade':  ['B',0,1,2,3,4,5,6,7,8],
     'ratings': [1,2,3,4,5]
   },
   // left side lists of routes
   'allroutes': [],
   'route_summaries': [],
  }
 
 #+END_SRC

