hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
model-view
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
model
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<p>what do we want to track, what color, grade, and status options are allowed</p>
<div class="src src-javascript">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-javascript" data-lang="javascript"><span style="display:flex;"><span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">empty_route_info</span> <span style="color:#f92672">=</span> {
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;area&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;set_date&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;setter&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;name&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>,
</span></span><span style="display:flex;"><span> <span style="color:#75715e">//status and rate are dropdowns
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span> <span style="color:#75715e">// must be &#34;&#34; instead of null so dropbox selects it
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span> <span style="color:#e6db74">&#39;grade_full&#39;</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;&#34;</span>, 
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;status&#39;</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;&#34;</span>, 
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;rate&#39;</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;&#34;</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;color&#39;</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#34;&#34;</span>, 
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;note&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;location&#39;</span><span style="color:#f92672">:</span> <span style="color:#e6db74">&#39;TCW_boulder&#39;</span>,
</span></span><span style="display:flex;"><span> <span style="color:#e6db74">&#39;climber&#39;</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">null</span>
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">model</span> <span style="color:#f92672">=</span> 
</span></span><span style="display:flex;"><span> {<span style="color:#e6db74">&#39;current&#39;</span><span style="color:#f92672">:</span> <span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">parse</span>(<span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">stringify</span>(<span style="color:#a6e22e">empty_route_info</span>)),
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#39;options&#39;</span><span style="color:#f92672">:</span> {
</span></span><span style="display:flex;"><span>    <span style="color:#e6db74">&#39;status&#39;</span><span style="color:#f92672">:</span> [<span style="color:#e6db74">&#39;on-sight&#39;</span>,<span style="color:#e6db74">&#39;completed&#39;</span>,<span style="color:#e6db74">&#39;peiced&#39;</span>,<span style="color:#e6db74">&#39;75%&#39;</span>,<span style="color:#e6db74">&#39;50%&#39;</span>,<span style="color:#e6db74">&#39;25%&#39;</span>,<span style="color:#e6db74">&#39;started&#39;</span>,<span style="color:#e6db74">&#39;skipped&#39;</span>],
</span></span><span style="display:flex;"><span>    <span style="color:#e6db74">&#39;color&#39;</span><span style="color:#f92672">:</span>  [<span style="color:#e6db74">&#39;red&#39;</span>,<span style="color:#e6db74">&#39;orange&#39;</span>,<span style="color:#e6db74">&#39;yellow&#39;</span>,<span style="color:#e6db74">&#39;green&#39;</span>,<span style="color:#e6db74">&#39;blue&#39;</span>,<span style="color:#e6db74">&#39;pink&#39;</span>,<span style="color:#e6db74">&#39;black&#39;</span>,<span style="color:#e6db74">&#39;white&#39;</span>,<span style="color:#e6db74">&#39;stripped&#39;</span>,<span style="color:#e6db74">&#39;rainbow&#39;</span>,<span style="color:#e6db74">&#39;graphic&#39;</span>],
</span></span><span style="display:flex;"><span>    <span style="color:#e6db74">&#39;grade&#39;</span><span style="color:#f92672">:</span>  [<span style="color:#e6db74">&#39;B&#39;</span>,<span style="color:#ae81ff">0</span>,<span style="color:#ae81ff">1</span>,<span style="color:#ae81ff">2</span>,<span style="color:#ae81ff">3</span>,<span style="color:#ae81ff">4</span>,<span style="color:#ae81ff">5</span>,<span style="color:#ae81ff">6</span>,<span style="color:#ae81ff">7</span>,<span style="color:#ae81ff">8</span>],
</span></span><span style="display:flex;"><span>    <span style="color:#e6db74">&#39;ratings&#39;</span><span style="color:#f92672">:</span> [<span style="color:#ae81ff">1</span>,<span style="color:#ae81ff">2</span>,<span style="color:#ae81ff">3</span>,<span style="color:#ae81ff">4</span>,<span style="color:#ae81ff">5</span>]
</span></span><span style="display:flex;"><span>  },
</span></span><span style="display:flex;"><span>  <span style="color:#75715e">// left side lists of routes
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>  <span style="color:#e6db74">&#39;allroutes&#39;</span><span style="color:#f92672">:</span> [],
</span></span><span style="display:flex;"><span>  <span style="color:#e6db74">&#39;route_summaries&#39;</span><span style="color:#f92672">:</span> [],
</span></span><span style="display:flex;"><span> }</span></span></code></pre></div>
</div>
</div>
</div>
