hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
View (and send)
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<p>Vue does the heaving lifting. define two functions</p>
<ul>
<li>grade_combined to change B to -1 and add the half grade</li>
<li>addCurrent to send away the selection+status</li>
</ul>
<div class="src src-javascript">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-javascript" data-lang="javascript"><span style="display:flex;"><span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">sendaway</span>(<span style="color:#a6e22e">data</span>) {
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">//console.log(&#39;sending&#39;,data)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#66d9ef">var</span> <span style="color:#a6e22e">x</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> <span style="color:#a6e22e">XMLHttpRequest</span>()
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">open</span>(<span style="color:#e6db74">&#39;POST&#39;</span>,<span style="color:#e6db74">&#39;/add&#39;</span>,<span style="color:#66d9ef">true</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">setRequestHeader</span>(<span style="color:#e6db74">&#34;Content-type&#34;</span>,<span style="color:#e6db74">&#34;application/json&#34;</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">send</span>(<span style="color:#a6e22e">data</span>)
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">ajax_update</span>(<span style="color:#a6e22e">path</span>,<span style="color:#a6e22e">onready</span>){
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">var</span> <span style="color:#a6e22e">x</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> <span style="color:#a6e22e">XMLHttpRequest</span>()
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">onreadystatechange</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">if</span> (<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">readyState</span> <span style="color:#f92672">==</span> <span style="color:#ae81ff">4</span> <span style="color:#f92672">&amp;&amp;</span> <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">status</span> <span style="color:#f92672">==</span> <span style="color:#ae81ff">200</span>){
</span></span><span style="display:flex;"><span>           <span style="color:#a6e22e">onready</span>(<span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">parse</span>(<span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">response</span>))
</span></span><span style="display:flex;"><span>       }
</span></span><span style="display:flex;"><span>     }
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">open</span>(<span style="color:#e6db74">&#39;GET&#39;</span>,<span style="color:#a6e22e">path</span>,<span style="color:#66d9ef">true</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">//x.setRequestHeader(&#34;Content-type&#34;,&#34;application/json&#34;) // overrideMimeType
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#a6e22e">x</span>.<span style="color:#a6e22e">send</span>()
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span><span style="color:#75715e">// format a date field in a list of hashes/dicts
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">// from python datetime
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">frmt_date</span>(<span style="color:#a6e22e">a</span>,<span style="color:#a6e22e">field</span>) {
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">for</span>(<span style="color:#66d9ef">var</span> <span style="color:#a6e22e">i</span><span style="color:#f92672">=</span><span style="color:#ae81ff">0</span>; <span style="color:#a6e22e">i</span> <span style="color:#f92672">&lt;</span> <span style="color:#a6e22e">a</span>.<span style="color:#a6e22e">length</span>; <span style="color:#a6e22e">i</span><span style="color:#f92672">++</span>){
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">if</span>( <span style="color:#f92672">!</span> <span style="color:#a6e22e">a</span>[<span style="color:#a6e22e">i</span>][<span style="color:#a6e22e">field</span>] ) { <span style="color:#66d9ef">continue</span> }
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">var</span> <span style="color:#a6e22e">d</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> Date(<span style="color:#a6e22e">a</span>[<span style="color:#a6e22e">i</span>][<span style="color:#a6e22e">field</span>] <span style="color:#f92672">*</span> <span style="color:#ae81ff">1000</span>)
</span></span><span style="display:flex;"><span>      <span style="color:#a6e22e">a</span>[<span style="color:#a6e22e">i</span>][<span style="color:#a6e22e">field</span>] <span style="color:#f92672">=</span> <span style="color:#a6e22e">d</span>.<span style="color:#a6e22e">toISOString</span>().<span style="color:#a6e22e">substr</span>(<span style="color:#ae81ff">0</span>,<span style="color:#ae81ff">16</span>).<span style="color:#a6e22e">replace</span>(<span style="color:#e6db74">&#39;T&#39;</span>,<span style="color:#e6db74">&#39; &#39;</span>)
</span></span><span style="display:flex;"><span>    }
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">return</span>(<span style="color:#a6e22e">a</span>)
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">isempty</span>(<span style="color:#a6e22e">x</span>){ <span style="color:#66d9ef">return</span>( <span style="color:#a6e22e">x</span> <span style="color:#f92672">===</span> <span style="color:#e6db74">&#34;&#34;</span> <span style="color:#f92672">||</span> <span style="color:#a6e22e">x</span> <span style="color:#f92672">==</span> <span style="color:#66d9ef">null</span> <span style="color:#f92672">||</span> <span style="color:#a6e22e">x</span> <span style="color:#f92672">==</span> <span style="color:#66d9ef">undefined</span>) }
</span></span><span style="display:flex;"><span><span style="color:#75715e">// for filtering. return true when not set, or when matches
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">null_or_match</span>(<span style="color:#a6e22e">x</span>,<span style="color:#a6e22e">m</span>) {
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">if</span>( <span style="color:#a6e22e">x</span> <span style="color:#f92672">!==</span> <span style="color:#ae81ff">0</span> <span style="color:#f92672">&amp;&amp;</span> <span style="color:#a6e22e">isempty</span>(<span style="color:#a6e22e">x</span>) ) {
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">return</span>(<span style="color:#66d9ef">true</span>)
</span></span><span style="display:flex;"><span>  }
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">return</span>(<span style="color:#a6e22e">x</span> <span style="color:#f92672">==</span> <span style="color:#a6e22e">m</span>) 
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">vueControler</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">new</span> <span style="color:#a6e22e">Vue</span>({
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">el</span><span style="color:#f92672">:</span><span style="color:#e6db74">&#34;#climbing_spa&#34;</span>,
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">data</span><span style="color:#f92672">:</span> <span style="color:#a6e22e">model</span>, 
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">computed</span><span style="color:#f92672">:</span> {
</span></span><span style="display:flex;"><span>   <span style="color:#75715e">//current_grade: this.grade_combined
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>   <span style="color:#a6e22e">current_grade</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(){
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">grade</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">grade_full</span> <span style="color:#f92672">==</span> <span style="color:#e6db74">&#39;B&#39;</span> <span style="color:#f92672">?</span> <span style="color:#f92672">-</span><span style="color:#ae81ff">1</span> <span style="color:#f92672">:</span> parseInt(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">grade_full</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">//console.log(&#39;current_grade computed:&#39;,this.current.grade_full,grade,isNaN(grade))
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#66d9ef">if</span>(isNaN(<span style="color:#a6e22e">grade</span>)){ <span style="color:#66d9ef">return</span>(<span style="color:#66d9ef">null</span>) }
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">return</span> (<span style="color:#a6e22e">grade</span> <span style="color:#f92672">+</span> (<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">plus_half</span> <span style="color:#f92672">?</span> .<span style="color:#ae81ff">5</span> <span style="color:#f92672">:</span> <span style="color:#ae81ff">0</span>) )
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">have_any_current</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span>(<span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span>)  <span style="color:#f92672">||</span>
</span></span><span style="display:flex;"><span>             <span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">color</span>) <span style="color:#f92672">||</span> 
</span></span><span style="display:flex;"><span>             <span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current_grade</span>) )
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">have_all_current</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span>(<span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span>)  <span style="color:#f92672">&amp;&amp;</span>
</span></span><span style="display:flex;"><span>             <span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">color</span>) <span style="color:#f92672">&amp;&amp;</span> 
</span></span><span style="display:flex;"><span>             <span style="color:#f92672">!</span><span style="color:#a6e22e">isempty</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current_grade</span>) )
</span></span><span style="display:flex;"><span>   }
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span> },
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">methods</span><span style="color:#f92672">:</span> {
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">setClimber</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">climber</span>){
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">if</span>(<span style="color:#a6e22e">climber</span> <span style="color:#f92672">===</span> <span style="color:#66d9ef">null</span> ){
</span></span><span style="display:flex;"><span>          <span style="color:#a6e22e">climber</span> <span style="color:#f92672">=</span>  <span style="color:#a6e22e">prompt</span>(<span style="color:#e6db74">&#39;Who are you?&#39;</span>)
</span></span><span style="display:flex;"><span>      }
</span></span><span style="display:flex;"><span>      <span style="color:#a6e22e">empty_route_info</span>[<span style="color:#e6db74">&#39;climber&#39;</span>] <span style="color:#f92672">=</span> <span style="color:#a6e22e">climber</span>
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">climber</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">empty_route_info</span>[<span style="color:#e6db74">&#39;climber&#39;</span>]
</span></span><span style="display:flex;"><span>      <span style="color:#75715e">// set cookie
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>      document.<span style="color:#a6e22e">cookie</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#34;max-age=31536000&#34;</span>
</span></span><span style="display:flex;"><span>      document.<span style="color:#a6e22e">cookie</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#34;climber=&#34;</span><span style="color:#f92672">+</span> <span style="color:#a6e22e">climber</span>
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">matches_current</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">r</span>){
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">//console.log(&#39;match current? r:&#39;,JSON.stringify(r),&#39; current:&#39;,JSON.stringify(this.current))
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#66d9ef">return</span>( <span style="color:#a6e22e">null_or_match</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">color</span>,<span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">color</span>) <span style="color:#f92672">&amp;&amp;</span>
</span></span><span style="display:flex;"><span>             <span style="color:#a6e22e">null_or_match</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current_grade</span>,<span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">grade</span>) <span style="color:#f92672">&amp;&amp;</span>
</span></span><span style="display:flex;"><span>             <span style="color:#a6e22e">null_or_match</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span>, <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">area</span>) )
</span></span><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">grade_combined</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(){
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">return</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current_grade</span>)
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">setCurrent</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">r</span>){
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;setCurrent&#39;</span>,<span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">stringify</span>(<span style="color:#a6e22e">r</span>))
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">color</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">color</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">area</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">name</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">name</span>
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">setter</span> <span style="color:#f92672">=</span>  <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">setter</span>
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">area_id</span> <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;#area_&#39;</span> <span style="color:#f92672">+</span> <span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">area</span>
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">// this calls to var and function created later by d3
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#a6e22e">svgdiv</span>.<span style="color:#a6e22e">select</span>(<span style="color:#a6e22e">area_id</span>).<span style="color:#a6e22e">each</span>(<span style="color:#a6e22e">select_area</span>)
</span></span><span style="display:flex;"><span>    
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">// grade_full is without the .5, and B if -1
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#a6e22e">newgrade</span> <span style="color:#f92672">=</span> parseFloat(<span style="color:#a6e22e">r</span>.<span style="color:#a6e22e">grade</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">if</span>(isNaN(<span style="color:#a6e22e">newgrade</span>)){<span style="color:#a6e22e">newgrade</span> <span style="color:#f92672">=</span> <span style="color:#ae81ff">0</span>}
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">//console.log(&#39;setCurrent grade from-&gt;to:&#39;,this.current.grade_full, r.grade, newgrade)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#66d9ef">if</span>( <span style="color:#a6e22e">newgrade</span> <span style="color:#f92672">&lt;</span> <span style="color:#ae81ff">0</span> ){
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">grade_full</span> <span style="color:#f92672">==</span> <span style="color:#e6db74">&#34;B&#34;</span>
</span></span><span style="display:flex;"><span>    }<span style="color:#66d9ef">else</span> {   
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">grade_full</span> <span style="color:#f92672">=</span> Math.<span style="color:#a6e22e">floor</span>(<span style="color:#a6e22e">newgrade</span>)
</span></span><span style="display:flex;"><span>    }
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">// update half point checkbox
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#a6e22e">newplushalf</span><span style="color:#f92672">=</span>(<span style="color:#a6e22e">newgrade</span> <span style="color:#f92672">!=</span> Math.<span style="color:#a6e22e">floor</span>(<span style="color:#a6e22e">newgrade</span>))
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">//console.log(&#39;setCurrent half old,new: &#39;,this.current.plus_half, newplushalf)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">plus_half</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">newplushalf</span>
</span></span><span style="display:flex;"><span>    
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">// research all logs of this 
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#a6e22e">listURL</span> <span style="color:#f92672">=</span> [<span style="color:#e6db74">&#39;list&#39;</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">location</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span>,<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">color</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current_grade</span>].<span style="color:#a6e22e">join</span>(<span style="color:#e6db74">&#39;/&#39;</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">ajax_update</span>(<span style="color:#e6db74">&#39;/&#39;</span> <span style="color:#f92672">+</span> <span style="color:#a6e22e">listURL</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">fetchAllstatuses</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;updated allroutes&#39;</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">allroutes</span>)
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">addCurrent</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(){
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">grade</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">grade_combined</span>()
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">data</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">stringify</span>(<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">sendaway</span>(<span style="color:#a6e22e">data</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">// update view to empyt state
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#75715e">// TODO: maybe keep
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">updateList</span>()
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">reset_current</span>()
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#75715e">// cannot use until page is loaded because reset color defied later
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>   <span style="color:#75715e">// means we code copy of empty_route_info twice
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>   <span style="color:#a6e22e">reset_current</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(){
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">parse</span>(<span style="color:#a6e22e">JSON</span>.<span style="color:#a6e22e">stringify</span>(<span style="color:#a6e22e">empty_route_info</span>))
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">reset_color</span>()
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">updateList</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;update summary&#39;</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">// all routes
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#a6e22e">ajax_update</span>(<span style="color:#e6db74">&#39;/summary/&#39;</span><span style="color:#f92672">+</span><span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">location</span>, <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">fetchClimbSummaries</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">// all statuses
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#75715e">// ajax_update(&#39;/list/&#39;+this.current.location, this.fetchAllstatuses)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#75715e">/* get data from api server */</span>
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">fetchAllstatuses</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">d</span>){
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">var</span> <span style="color:#a6e22e">self</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">this</span>
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#a6e22e">d</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">self</span>.<span style="color:#a6e22e">allroutes</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">frmt_date</span>(<span style="color:#a6e22e">d</span>,<span style="color:#e6db74">&#39;timestamp&#39;</span>)
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>   <span style="color:#a6e22e">fetchClimbSummaries</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">d</span>){
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">var</span> <span style="color:#a6e22e">self</span> <span style="color:#f92672">=</span> <span style="color:#66d9ef">this</span>
</span></span><span style="display:flex;"><span>    <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#a6e22e">d</span>)
</span></span><span style="display:flex;"><span>    <span style="color:#75715e">// clean up: unixtimestamp to iso date
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>    <span style="color:#a6e22e">self</span>.<span style="color:#a6e22e">route_summaries</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">frmt_date</span>(<span style="color:#a6e22e">d</span>,<span style="color:#e6db74">&#39;recent&#39;</span>)
</span></span><span style="display:flex;"><span>   },
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span> },
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">mounted</span><span style="color:#f92672">:</span> <span style="color:#66d9ef">function</span>(){
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">//console.log(&#39;mounting&#39;)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">updateList</span>()
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">// use cookie or prompt for climber(user)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#75715e">// should match climber=MY_CLIMBING_ID
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>     <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;setting cookie&#39;</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">m</span><span style="color:#f92672">=</span>decodeURIComponent(document.<span style="color:#a6e22e">cookie</span>).<span style="color:#a6e22e">match</span>(<span style="color:#e6db74">&#39;climber=([^;]+)&#39;</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">climber</span><span style="color:#f92672">=</span><span style="color:#a6e22e">m</span><span style="color:#f92672">?</span><span style="color:#a6e22e">m</span>[<span style="color:#ae81ff">1</span>]<span style="color:#f92672">:</span><span style="color:#66d9ef">null</span>
</span></span><span style="display:flex;"><span>     <span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">setClimber</span>(<span style="color:#a6e22e">climber</span>)
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#e6db74">&#39;climber = &#39;</span>,<span style="color:#66d9ef">this</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">climber</span>,<span style="color:#e6db74">&#39;; should be:&#39;</span>, <span style="color:#a6e22e">climber</span>)
</span></span><span style="display:flex;"><span> }
</span></span><span style="display:flex;"><span>})</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
