reports/climbingWallSPA.org
** selecting areas
   We want to click an area. This depends on the svg floor plan loaded later.
 #+BEGIN_SRC javascript :tangle climbarea.js :exports code
 // setup
//var svgdiv = d3.select("body").append("div");
//svgdiv.attr("id","climbingAreas")
var svgdiv = d3.select("div#climbingAreas");


var svg;
var clickable;

function reset_color() {
  clickable.each( function() {
      d3.select(this).style('fill','green')  
  })
}

function select_area() {
 reset_color()
 area = d3.select(this)
 area.style('fill','red')
 name = area.attr('id').match(/area_(.*)/)[1]
 model.current.area = name
 console.log(name)
}

#+END_SRC

** inserting svg and area clicks
   The floor plan for the boldering area has already been created as an svg.
 ~rect~ and ~path~ svg elements define areas that will contain routes and have an ID starting with ~area_~.
#+BEGIN_SRC javascript :tangle climbarea.js :exports code
 
// inject svg, define clickable
d3.xml("outline.svg", function(error, documentFragment) {
        if (error) {console.log(error); return;}
        
        svgdiv.node().appendChild(
             documentFragment.getElementsByTagName("svg")[0]
        );

        svg = svgdiv.select("svg")

        // shrink 
        svg.attr("width", "400")
        svg.attr("height", "250")

        allpaths = svg.selectAll('path,rect')

        clickable = allpaths.filter(function() {
             id=d3.select(this).attr('id')
             return( id !== null && id.match(/area/) !== null ) 
        })
           
        clickable.each( function() {
              p=d3.select(this)
              p.style('cursor','pointer')
              p.on('click',select_area)
        })
    });
 #+END_SRC

** Server
We want to log this persistent. It'd be cool to compare to others too. First lets just get recording working.
http://localhost:8080/index.html

*** testing the server
 #+BEGIN_SRC bash :exports code  :exports code :results none
data='{"color": "red", "grade": 3, 
     "area": "45",
     "status": "completed", "rate": 4,
     "note": "fun",
     "location": "TCW_boulder",
     "climber": "WF"
    }'
http POST http://localhost:8080/add Content-type:application/json <<<"$data" 
 #+END_SRC

