hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-11" class="outline-3">
<h3 id="headline-11">
selecting areas
</h3>
<div id="outline-text-headline-11" class="outline-text-3">
<p>We want to click an area. This depends on the svg floor plan loaded later.</p>
<div class="src src-javascript">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-javascript" data-lang="javascript"><span style="display:flex;"><span><span style="color:#75715e">// setup
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">//var svgdiv = d3.select(&#34;body&#34;).append(&#34;div&#34;);
</span></span></span><span style="display:flex;"><span><span style="color:#75715e">//svgdiv.attr(&#34;id&#34;,&#34;climbingAreas&#34;)
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">svgdiv</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">select</span>(<span style="color:#e6db74">&#34;div#climbingAreas&#34;</span>);
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">svg</span>;
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">var</span> <span style="color:#a6e22e">clickable</span>;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">reset_color</span>() {
</span></span><span style="display:flex;"><span> <span style="color:#a6e22e">clickable</span>.<span style="color:#a6e22e">each</span>( <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>     <span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">select</span>(<span style="color:#66d9ef">this</span>).<span style="color:#a6e22e">style</span>(<span style="color:#e6db74">&#39;fill&#39;</span>,<span style="color:#e6db74">&#39;green&#39;</span>)  
</span></span><span style="display:flex;"><span> })
</span></span><span style="display:flex;"><span>}
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#66d9ef">function</span> <span style="color:#a6e22e">select_area</span>() {
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">reset_color</span>()
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">area</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">select</span>(<span style="color:#66d9ef">this</span>)
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">area</span>.<span style="color:#a6e22e">style</span>(<span style="color:#e6db74">&#39;fill&#39;</span>,<span style="color:#e6db74">&#39;red&#39;</span>)
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">name</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">area</span>.<span style="color:#a6e22e">attr</span>(<span style="color:#e6db74">&#39;id&#39;</span>).<span style="color:#a6e22e">match</span>(<span style="color:#e6db74">/area_(.*)/</span>)[<span style="color:#ae81ff">1</span>]
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">model</span>.<span style="color:#a6e22e">current</span>.<span style="color:#a6e22e">area</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">name</span>
</span></span><span style="display:flex;"><span><span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#a6e22e">name</span>)
</span></span><span style="display:flex;"><span>}</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
inserting svg and area clicks
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>The floor plan for the boldering area has already been created as an svg.
 <code>rect</code> and <code>path</code> svg elements define areas that will contain routes and have an ID starting with <code>area_</code>.</p>
<div class="src src-javascript">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-javascript" data-lang="javascript"><span style="display:flex;"><span> 
</span></span><span style="display:flex;"><span><span style="color:#75715e">// inject svg, define clickable
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span><span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">xml</span>(<span style="color:#e6db74">&#34;outline.svg&#34;</span>, <span style="color:#66d9ef">function</span>(<span style="color:#a6e22e">error</span>, <span style="color:#a6e22e">documentFragment</span>) {
</span></span><span style="display:flex;"><span>        <span style="color:#66d9ef">if</span> (<span style="color:#a6e22e">error</span>) {<span style="color:#a6e22e">console</span>.<span style="color:#a6e22e">log</span>(<span style="color:#a6e22e">error</span>); <span style="color:#66d9ef">return</span>;}
</span></span><span style="display:flex;"><span>        
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">svgdiv</span>.<span style="color:#a6e22e">node</span>().<span style="color:#a6e22e">appendChild</span>(
</span></span><span style="display:flex;"><span>             <span style="color:#a6e22e">documentFragment</span>.<span style="color:#a6e22e">getElementsByTagName</span>(<span style="color:#e6db74">&#34;svg&#34;</span>)[<span style="color:#ae81ff">0</span>]
</span></span><span style="display:flex;"><span>        );
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">svg</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">svgdiv</span>.<span style="color:#a6e22e">select</span>(<span style="color:#e6db74">&#34;svg&#34;</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>        <span style="color:#75715e">// shrink 
</span></span></span><span style="display:flex;"><span><span style="color:#75715e"></span>        <span style="color:#a6e22e">svg</span>.<span style="color:#a6e22e">attr</span>(<span style="color:#e6db74">&#34;width&#34;</span>, <span style="color:#e6db74">&#34;400&#34;</span>)
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">svg</span>.<span style="color:#a6e22e">attr</span>(<span style="color:#e6db74">&#34;height&#34;</span>, <span style="color:#e6db74">&#34;250&#34;</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">allpaths</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">svg</span>.<span style="color:#a6e22e">selectAll</span>(<span style="color:#e6db74">&#39;path,rect&#39;</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">clickable</span> <span style="color:#f92672">=</span> <span style="color:#a6e22e">allpaths</span>.<span style="color:#a6e22e">filter</span>(<span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>             <span style="color:#a6e22e">id</span><span style="color:#f92672">=</span><span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">select</span>(<span style="color:#66d9ef">this</span>).<span style="color:#a6e22e">attr</span>(<span style="color:#e6db74">&#39;id&#39;</span>)
</span></span><span style="display:flex;"><span>             <span style="color:#66d9ef">return</span>( <span style="color:#a6e22e">id</span> <span style="color:#f92672">!==</span> <span style="color:#66d9ef">null</span> <span style="color:#f92672">&amp;&amp;</span> <span style="color:#a6e22e">id</span>.<span style="color:#a6e22e">match</span>(<span style="color:#e6db74">/area/</span>) <span style="color:#f92672">!==</span> <span style="color:#66d9ef">null</span> ) 
</span></span><span style="display:flex;"><span>        })
</span></span><span style="display:flex;"><span>           
</span></span><span style="display:flex;"><span>        <span style="color:#a6e22e">clickable</span>.<span style="color:#a6e22e">each</span>( <span style="color:#66d9ef">function</span>() {
</span></span><span style="display:flex;"><span>              <span style="color:#a6e22e">p</span><span style="color:#f92672">=</span><span style="color:#a6e22e">d3</span>.<span style="color:#a6e22e">select</span>(<span style="color:#66d9ef">this</span>)
</span></span><span style="display:flex;"><span>              <span style="color:#a6e22e">p</span>.<span style="color:#a6e22e">style</span>(<span style="color:#e6db74">&#39;cursor&#39;</span>,<span style="color:#e6db74">&#39;pointer&#39;</span>)
</span></span><span style="display:flex;"><span>              <span style="color:#a6e22e">p</span>.<span style="color:#a6e22e">on</span>(<span style="color:#e6db74">&#39;click&#39;</span>,<span style="color:#a6e22e">select_area</span>)
</span></span><span style="display:flex;"><span>        })
</span></span><span style="display:flex;"><span>    });</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Server
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<p>We want to log this persistent. It&#39;d be cool to compare to others too. First lets just get recording working.
<a href="http://localhost:8080/index.html">http://localhost:8080/index.html</a></p>
<div id="outline-container-headline-14" class="outline-4">
<h4 id="headline-14">
testing the server
</h4>
<div id="outline-text-headline-14" class="outline-text-4">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>data<span style="color:#f92672">=</span><span style="color:#e6db74">&#39;{&#34;color&#34;: &#34;red&#34;, &#34;grade&#34;: 3, 
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    &#34;area&#34;: &#34;45&#34;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    &#34;status&#34;: &#34;completed&#34;, &#34;rate&#34;: 4,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    &#34;note&#34;: &#34;fun&#34;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    &#34;location&#34;: &#34;TCW_boulder&#34;,
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">    &#34;climber&#34;: &#34;WF&#34;
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">   }&#39;</span>
</span></span><span style="display:flex;"><span>http POST http://localhost:8080/add Content-type:application/json <span style="color:#f92672">&lt;&lt;&lt;</span><span style="color:#e6db74">&#34;</span>$data<span style="color:#e6db74">&#34;</span></span></span></code></pre></div>
</div>
</div>
</div>
