hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
quick API
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<p>Written with bottle. Statically serving other files.</p>
<div class="src src-python">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-python" data-lang="python"><span style="display:flex;"><span>  <span style="color:#75715e">#!/usr/bin/env python3</span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># (elpy-use-ipython)</span>
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">from</span> bottle <span style="color:#f92672">import</span> route, run, post, static_file, request, response
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">from</span> tinydb <span style="color:#f92672">import</span> TinyDB, Query
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">import</span> datetime
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">import</span> json
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">from</span> climb_summary <span style="color:#f92672">import</span> climb_summary
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  db <span style="color:#f92672">=</span> TinyDB(<span style="color:#e6db74">&#39;./climbing_status.json&#39;</span>)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/add&#39;</span>,method<span style="color:#f92672">=</span><span style="color:#e6db74">&#39;POST&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">add</span>():
</span></span><span style="display:flex;"><span>      data <span style="color:#f92672">=</span> request<span style="color:#f92672">.</span>json
</span></span><span style="display:flex;"><span>      data[<span style="color:#e6db74">&#39;timestamp&#39;</span>] <span style="color:#f92672">=</span> datetime<span style="color:#f92672">.</span>datetime<span style="color:#f92672">.</span>now()<span style="color:#f92672">.</span>timestamp()
</span></span><span style="display:flex;"><span>      print(data)
</span></span><span style="display:flex;"><span>      db<span style="color:#f92672">.</span>insert(data)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># just list all statuses from a location</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/list/&lt;location&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">list</span>(location<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;TCW_boulder&#34;</span>):
</span></span><span style="display:flex;"><span>      q <span style="color:#f92672">=</span> Query()
</span></span><span style="display:flex;"><span>      r <span style="color:#f92672">=</span> db<span style="color:#f92672">.</span>search(q<span style="color:#f92672">.</span>location <span style="color:#f92672">==</span> location)
</span></span><span style="display:flex;"><span>      response<span style="color:#f92672">.</span>content_type <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;application/json&#39;</span>
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span> json<span style="color:#f92672">.</span>dumps(r)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># list summary for a location</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/summary&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/summary/&lt;location&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/summary/&lt;location&gt;/&lt;sortby&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">list</span>(location<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;TCW_boulder&#34;</span>,sortby<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;cnt&#34;</span>):
</span></span><span style="display:flex;"><span>      q <span style="color:#f92672">=</span> Query()
</span></span><span style="display:flex;"><span>      r <span style="color:#f92672">=</span> db<span style="color:#f92672">.</span>search(q<span style="color:#f92672">.</span>location <span style="color:#f92672">==</span> location)
</span></span><span style="display:flex;"><span>      s <span style="color:#f92672">=</span> climb_summary(r,sortby)
</span></span><span style="display:flex;"><span>      response<span style="color:#f92672">.</span>content_type <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;application/json&#39;</span>
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span> json<span style="color:#f92672">.</span>dumps(s)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># specific route information</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/list/&lt;location&gt;/&lt;area&gt;/&lt;color&gt;/&lt;grade&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/list/&lt;location&gt;/&lt;area&gt;/&lt;color&gt;/&lt;grade&gt;/&lt;sortby&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">list</span>(location,area,color,grade,sortby<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;cnt&#34;</span>):
</span></span><span style="display:flex;"><span>      q <span style="color:#f92672">=</span> Query()
</span></span><span style="display:flex;"><span>      r <span style="color:#f92672">=</span> db<span style="color:#f92672">.</span>search( (q<span style="color:#f92672">.</span>location <span style="color:#f92672">==</span> location) <span style="color:#f92672">&amp;</span> (q<span style="color:#f92672">.</span>area <span style="color:#f92672">==</span> area) <span style="color:#f92672">&amp;</span>
</span></span><span style="display:flex;"><span>                     (q<span style="color:#f92672">.</span>color <span style="color:#f92672">==</span> color) <span style="color:#f92672">&amp;</span> (q<span style="color:#f92672">.</span>grade <span style="color:#f92672">==</span> float(grade)) )
</span></span><span style="display:flex;"><span>      response<span style="color:#f92672">.</span>content_type <span style="color:#f92672">=</span> <span style="color:#e6db74">&#39;application/json&#39;</span>
</span></span><span style="display:flex;"><span>      <span style="color:#75715e">#print(&#39;looking for loc &#34;%s&#34; area &#34;%s&#34; color &#34;%s&#34; grade &#34;%s&#34;&#39; % (location, area, color, grade) )</span>
</span></span><span style="display:flex;"><span>      <span style="color:#75715e">#print(&#34;found %d&#34; % len(r))</span>
</span></span><span style="display:flex;"><span>      <span style="color:#75715e">#s = climb_summary(r,sortby)</span>
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span> json<span style="color:#f92672">.</span>dumps(r)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># all filenames are static</span>
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#a6e22e">@route</span>(<span style="color:#e6db74">&#39;/&lt;filename&gt;&#39;</span>)
</span></span><span style="display:flex;"><span>  <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">static_f</span>(filename<span style="color:#f92672">=</span><span style="color:#e6db74">&#39;index.html&#39;</span>):
</span></span><span style="display:flex;"><span>      <span style="color:#66d9ef">return</span>(static_file(filename, root<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;./&#34;</span>))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  run(host<span style="color:#f92672">=</span><span style="color:#e6db74">&#39;0.0.0.0&#39;</span>,port<span style="color:#f92672">=</span><span style="color:#ae81ff">8080</span>)</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-4">
<h4 id="headline-16">
supporting functions
</h4>
<div id="outline-text-headline-16" class="outline-text-4">
<p>this file exists to summarize the list of climbing statuses 
    the heavy lifting is done by <code>try_fill</code> which is a bad attempt at merging under specified climbing routes within a status to fully specified routes.
    no attempt is made to merge non-overlapping partials.
    set date is still ignored</p>
