hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-17" class="outline-5">
<h5 id="headline-17">
<span class="todo">TODO</span>
add set date to <code>try_fill</code> and friends
</h5>
<div id="outline-text-headline-17" class="outline-text-5">
<div class="src src-python">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-python" data-lang="python"><span style="display:flex;"><span>   <span style="color:#f92672">from</span> itertools <span style="color:#f92672">import</span> groupby
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># helper functions</span>
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">groupinfo</span>(itera):
</span></span><span style="display:flex;"><span>       <span style="color:#e6db74">&#34;&#34;&#34;
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       :param itera: array iterator of climbing route dicts from groupby
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       :returns: (dict) with summary stats for that group 
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       &#34;&#34;&#34;</span>
</span></span><span style="display:flex;"><span>       a <span style="color:#f92672">=</span> list(itera)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># rank calc requries a filter</span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># mabye worth importing numpy</span>
</span></span><span style="display:flex;"><span>       ranks <span style="color:#f92672">=</span> list(filter( <span style="color:#66d9ef">lambda</span> x: x <span style="color:#f92672">is</span> <span style="color:#f92672">not</span> <span style="color:#66d9ef">None</span>, [x<span style="color:#f92672">.</span>get(<span style="color:#e6db74">&#39;rank&#39;</span>,<span style="color:#66d9ef">None</span>) <span style="color:#66d9ef">for</span> x <span style="color:#f92672">in</span> a]))
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">if</span> len(ranks) <span style="color:#f92672">&gt;</span> <span style="color:#ae81ff">0</span>:
</span></span><span style="display:flex;"><span>           avgrank <span style="color:#f92672">=</span> sum(ranks)<span style="color:#f92672">/</span>len(ranks)
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">else</span>:
</span></span><span style="display:flex;"><span>           avgrank <span style="color:#f92672">=</span> <span style="color:#66d9ef">None</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       d <span style="color:#f92672">=</span> { <span style="color:#e6db74">&#39;cnt&#39;</span>: len(a),
</span></span><span style="display:flex;"><span>             <span style="color:#e6db74">&#39;recent&#39;</span>: max([<span style="color:#ae81ff">0</span>] <span style="color:#f92672">+</span> [x<span style="color:#f92672">.</span>get(<span style="color:#e6db74">&#39;timestamp&#39;</span>,<span style="color:#ae81ff">0</span>) <span style="color:#66d9ef">for</span> x <span style="color:#f92672">in</span> a]),
</span></span><span style="display:flex;"><span>             <span style="color:#e6db74">&#39;avgrank&#39;</span>: avgrank,
</span></span><span style="display:flex;"><span>           }
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">return</span>(d)
</span></span><span style="display:flex;"><span>    
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">climb_summary</span>(r,sortby<span style="color:#f92672">=</span><span style="color:#e6db74">&#39;cnt&#39;</span>):
</span></span><span style="display:flex;"><span>       header<span style="color:#f92672">=</span>[<span style="color:#e6db74">&#39;location&#39;</span>,<span style="color:#e6db74">&#39;area&#39;</span>,<span style="color:#e6db74">&#39;color&#39;</span>,<span style="color:#e6db74">&#39;grade&#39;</span>,<span style="color:#e6db74">&#39;setter&#39;</span>,<span style="color:#e6db74">&#39;name&#39;</span>]
</span></span><span style="display:flex;"><span>       g <span style="color:#f92672">=</span> groupby(r,<span style="color:#66d9ef">lambda</span> x: [x<span style="color:#f92672">.</span>get(k) <span style="color:#66d9ef">for</span> k <span style="color:#f92672">in</span> header] )
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># summarise all status into count and recent</span>
</span></span><span style="display:flex;"><span>       s <span style="color:#f92672">=</span> [{<span style="color:#e6db74">&#39;info&#39;</span>: k,
</span></span><span style="display:flex;"><span>             ,<span style="color:#f92672">**</span>groupinfo(a),
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># nfilled is the number of good values we have</span>
</span></span><span style="display:flex;"><span>             <span style="color:#e6db74">&#39;nfilled&#39;</span>: int(k[header<span style="color:#f92672">.</span>index(<span style="color:#e6db74">&#39;setter&#39;</span>)] <span style="color:#f92672">not</span> <span style="color:#f92672">in</span> [<span style="color:#66d9ef">None</span>, <span style="color:#e6db74">&#34;&#34;</span>]) <span style="color:#f92672">+</span>
</span></span><span style="display:flex;"><span>                        int(k[header<span style="color:#f92672">.</span>index(<span style="color:#e6db74">&#39;name&#39;</span>)] <span style="color:#f92672">not</span> <span style="color:#f92672">in</span> [<span style="color:#66d9ef">None</span>,<span style="color:#e6db74">&#34;&#34;</span>])
</span></span><span style="display:flex;"><span>             } <span style="color:#66d9ef">for</span> k, a <span style="color:#f92672">in</span> g]
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># break back into array of dict</span>
</span></span><span style="display:flex;"><span>       d <span style="color:#f92672">=</span> [ {
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># put back info as dict</span>
</span></span><span style="display:flex;"><span>             ,<span style="color:#f92672">**</span>{k: v <span style="color:#66d9ef">for</span> k,v <span style="color:#f92672">in</span> zip(header,x[<span style="color:#e6db74">&#39;info&#39;</span>])},
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># also add any other stats that we computed</span>
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># skip &#39;info&#39; </span>
</span></span><span style="display:flex;"><span>             ,<span style="color:#f92672">**</span>{k: x[k] <span style="color:#66d9ef">for</span> k <span style="color:#f92672">in</span> x <span style="color:#66d9ef">if</span> k <span style="color:#f92672">not</span> <span style="color:#f92672">in</span> [<span style="color:#e6db74">&#39;info&#39;</span>]}
</span></span><span style="display:flex;"><span>           } <span style="color:#66d9ef">for</span> x <span style="color:#f92672">in</span> s]
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># re-group to merge where setter or name is empty</span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># maybe we should do this will pandas forwardfill fillna </span>
</span></span><span style="display:flex;"><span>       d <span style="color:#f92672">=</span> fill_idna(d)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># sort</span>
</span></span><span style="display:flex;"><span>       s <span style="color:#f92672">=</span> sorted(d, key<span style="color:#f92672">=</span><span style="color:#66d9ef">lambda</span> x: x[sortby] )
</span></span><span style="display:flex;"><span>      
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">return</span>(d)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># this is absolutely misguided</span>
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># for a group of climbing dictionaries</span>
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># that all have the same loc,area,color, and grade</span>
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># match setter and name when we can</span>
</span></span><span style="display:flex;"><span>   <span style="color:#75715e"># might do terrible things when have only partial info for more than one climb</span>
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">try_fill</span>(itera):
</span></span><span style="display:flex;"><span>       <span style="color:#e6db74">&#34;&#34;&#34;
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       example
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       -------
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       itera = [
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       {&#39;nfilled&#39;: 2, &#39;setter&#39;: &#39;ab&#39;, &#39;name&#39;: &#39;xx&#39;, &#39;avgrank&#39;: 3, &#39;cnt&#39;: 10, &#39;recent&#39;: 9}, 
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       {&#39;nfilled&#39;: 1, &#39;setter&#39;: &#39;ab&#39;, &#39;name&#39;: &#39;&#39;, &#39;avgrank&#39;: 1, &#39;cnt&#39;: 2, &#39;recent&#39;: 0},
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       {&#39;nfilled&#39;: 1, &#39;setter&#39;: &#39;&#39;, &#39;name&#39;: &#39;xx&#39;, &#39;avgrank&#39;: 5, &#39;cnt&#39;: 1, &#39;recent&#39;: 10}]
</span></span></span><span style="display:flex;"><span><span style="color:#e6db74">       &#34;&#34;&#34;</span>
</span></span><span style="display:flex;"><span>       a_sorted <span style="color:#f92672">=</span> sorted(itera,key<span style="color:#f92672">=</span><span style="color:#66d9ef">lambda</span> x: <span style="color:#f92672">-</span>x<span style="color:#f92672">.</span>get(<span style="color:#e6db74">&#39;nfilled&#39;</span>,<span style="color:#ae81ff">0</span>))
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       matching <span style="color:#f92672">=</span> [<span style="color:#e6db74">&#39;setter&#39;</span>,<span style="color:#e6db74">&#39;name&#39;</span>]
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># build truth</span>
</span></span><span style="display:flex;"><span>       truth <span style="color:#f92672">=</span> []
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">while</span> len(a_sorted) <span style="color:#f92672">&gt;</span><span style="color:#ae81ff">0</span> <span style="color:#f92672">and</span> a_sorted[<span style="color:#ae81ff">0</span>][<span style="color:#e6db74">&#39;nfilled&#39;</span>] <span style="color:#f92672">&gt;=</span> <span style="color:#ae81ff">2</span>:
</span></span><span style="display:flex;"><span>           truth<span style="color:#f92672">.</span>append( a_sorted<span style="color:#f92672">.</span>pop(<span style="color:#ae81ff">0</span>) )
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># compare the rest to the truth</span>
</span></span><span style="display:flex;"><span>       <span style="color:#75715e"># add together if matches</span>
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">for</span> ti <span style="color:#f92672">in</span> range(len(truth)):
</span></span><span style="display:flex;"><span>         t <span style="color:#f92672">=</span> truth[ti]
</span></span><span style="display:flex;"><span>         a_keep <span style="color:#f92672">=</span> []
</span></span><span style="display:flex;"><span>         <span style="color:#66d9ef">for</span> ai <span style="color:#f92672">in</span> range(len(a_sorted)):
</span></span><span style="display:flex;"><span>             a <span style="color:#f92672">=</span> a_sorted[ai]
</span></span><span style="display:flex;"><span>             nmatches <span style="color:#f92672">=</span> sum([ int(t<span style="color:#f92672">.</span>get(i) <span style="color:#f92672">==</span> a<span style="color:#f92672">.</span>get(i) <span style="color:#f92672">and</span> t<span style="color:#f92672">.</span>get(i) <span style="color:#f92672">is</span> <span style="color:#f92672">not</span> <span style="color:#66d9ef">None</span>) <span style="color:#66d9ef">for</span> i <span style="color:#f92672">in</span> matching])
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># if we matched all the good parts of our partially emtpy dict</span>
</span></span><span style="display:flex;"><span>             <span style="color:#75715e"># update truth with this count and remove from a</span>
</span></span><span style="display:flex;"><span>             <span style="color:#66d9ef">if</span> nmatches <span style="color:#f92672">==</span> a[<span style="color:#e6db74">&#39;nfilled&#39;</span>]:
</span></span><span style="display:flex;"><span>                 truth[ti][<span style="color:#e6db74">&#39;recent&#39;</span>] <span style="color:#f92672">=</span> max(t[<span style="color:#e6db74">&#39;recent&#39;</span>],a[<span style="color:#e6db74">&#39;recent&#39;</span>])
</span></span><span style="display:flex;"><span>                 truth[ti][<span style="color:#e6db74">&#39;cnt&#39;</span>] <span style="color:#f92672">=</span> t[<span style="color:#e6db74">&#39;cnt&#39;</span>]<span style="color:#f92672">+</span>a[<span style="color:#e6db74">&#39;cnt&#39;</span>]
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>                 <span style="color:#75715e"># deal with null avgrank</span>
</span></span><span style="display:flex;"><span>                 cnt<span style="color:#f92672">=</span><span style="color:#ae81ff">1</span>
</span></span><span style="display:flex;"><span>                 <span style="color:#66d9ef">if</span> t[<span style="color:#e6db74">&#39;avgrank&#39;</span>]:
</span></span><span style="display:flex;"><span>                    tavg <span style="color:#f92672">=</span> t[<span style="color:#e6db74">&#39;cnt&#39;</span>]<span style="color:#f92672">*</span>t[<span style="color:#e6db74">&#39;avgrank&#39;</span>] 
</span></span><span style="display:flex;"><span>                    cnt <span style="color:#f92672">=</span> t[<span style="color:#e6db74">&#39;cnt&#39;</span>]
</span></span><span style="display:flex;"><span>                 <span style="color:#66d9ef">else</span>:
</span></span><span style="display:flex;"><span>                    tavg <span style="color:#f92672">=</span> <span style="color:#ae81ff">0</span>
</span></span><span style="display:flex;"><span>                 <span style="color:#66d9ef">if</span> a[<span style="color:#e6db74">&#39;avgrank&#39;</span>]:
</span></span><span style="display:flex;"><span>                    aavg <span style="color:#f92672">=</span> a[<span style="color:#e6db74">&#39;cnt&#39;</span>]<span style="color:#f92672">*</span>a[<span style="color:#e6db74">&#39;avgrank&#39;</span>] 
</span></span><span style="display:flex;"><span>                    cnt <span style="color:#f92672">=</span> cnt <span style="color:#f92672">+</span> t[<span style="color:#e6db74">&#39;cnt&#39;</span>]
</span></span><span style="display:flex;"><span>                 <span style="color:#66d9ef">else</span>:
</span></span><span style="display:flex;"><span>                    aavg<span style="color:#f92672">=</span><span style="color:#ae81ff">0</span>
</span></span><span style="display:flex;"><span>                 
</span></span><span style="display:flex;"><span>                 truth[ti][<span style="color:#e6db74">&#39;avgrank&#39;</span>] <span style="color:#f92672">=</span> (tavg <span style="color:#f92672">+</span> aavg)<span style="color:#f92672">/</span>cnt
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>             <span style="color:#66d9ef">else</span>:
</span></span><span style="display:flex;"><span>                 a_keep<span style="color:#f92672">.</span>append(ai)
</span></span><span style="display:flex;"><span>         a_sorted <span style="color:#f92672">=</span> [a_sorted[i] <span style="color:#66d9ef">for</span> i <span style="color:#f92672">in</span> a_keep]
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">return</span>(truth <span style="color:#f92672">+</span> a_sorted)
</span></span><span style="display:flex;"><span>              
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">fill_idna</span>(d):
</span></span><span style="display:flex;"><span>       header <span style="color:#f92672">=</span> [<span style="color:#e6db74">&#39;location&#39;</span>,<span style="color:#e6db74">&#39;area&#39;</span>,<span style="color:#e6db74">&#39;color&#39;</span>,<span style="color:#e6db74">&#39;grade&#39;</span>]
</span></span><span style="display:flex;"><span>       g <span style="color:#f92672">=</span> groupby(d, <span style="color:#66d9ef">lambda</span> x: [x<span style="color:#f92672">.</span>get(h) <span style="color:#66d9ef">for</span> h <span style="color:#f92672">in</span>  header])
</span></span><span style="display:flex;"><span>       m <span style="color:#f92672">=</span> [ {
</span></span><span style="display:flex;"><span>              <span style="color:#75715e"># header as dict</span>
</span></span><span style="display:flex;"><span>              ,<span style="color:#f92672">**</span>{k:v <span style="color:#66d9ef">for</span> k,v <span style="color:#f92672">in</span> zip(header,i)},
</span></span><span style="display:flex;"><span>              <span style="color:#75715e"># and merged (and leftovers) for this id</span>
</span></span><span style="display:flex;"><span>              ,<span style="color:#f92672">**</span>x} 
</span></span><span style="display:flex;"><span>           <span style="color:#66d9ef">for</span> i, a <span style="color:#f92672">in</span> g
</span></span><span style="display:flex;"><span>           <span style="color:#66d9ef">for</span> x <span style="color:#f92672">in</span> try_fill(a) ]
</span></span><span style="display:flex;"><span>       <span style="color:#66d9ef">return</span>(m)
</span></span><span style="display:flex;"><span>       
</span></span><span style="display:flex;"><span>   <span style="color:#66d9ef">def</span> <span style="color:#a6e22e">to_df_fill</span>(r):
</span></span><span style="display:flex;"><span>    df <span style="color:#f92672">=</span> pd<span style="color:#f92672">.</span>DataFrame(r)<span style="color:#f92672">.</span>\
</span></span><span style="display:flex;"><span>         assign(nrate<span style="color:#f92672">=</span> <span style="color:#66d9ef">lambda</span> x: x<span style="color:#f92672">.</span>rank <span style="color:#f92672">is</span> <span style="color:#f92672">not</span> <span style="color:#66d9ef">None</span>)<span style="color:#f92672">.</span>\
</span></span><span style="display:flex;"><span>         groupby([<span style="color:#e6db74">&#39;location&#39;</span>,<span style="color:#e6db74">&#39;area&#39;</span>,<span style="color:#e6db74">&#39;color&#39;</span>,<span style="color:#e6db74">&#39;grade&#39;</span>])<span style="color:#f92672">.</span>\
</span></span><span style="display:flex;"><span>         aggregate(
</span></span><span style="display:flex;"><span>          {<span style="color:#e6db74">&#39;timestamp&#39;</span>: <span style="color:#e6db74">&#39;max&#39;</span>,
</span></span><span style="display:flex;"><span>           <span style="color:#e6db74">&#39;climber&#39;</span>: <span style="color:#66d9ef">lambda</span> x: x<span style="color:#f92672">.</span>size,
</span></span><span style="display:flex;"><span>           <span style="color:#e6db74">&#39;rate&#39;</span>: <span style="color:#e6db74">&#39;sum&#39;</span>,
</span></span><span style="display:flex;"><span>           <span style="color:#e6db74">&#39;nrate&#39;</span>: <span style="color:#e6db74">&#39;sum&#39;</span>
</span></span><span style="display:flex;"><span>           })
</span></span><span style="display:flex;"><span>            
</span></span><span style="display:flex;"><span>    <span style="color:#66d9ef">return</span>(df<span style="color:#f92672">.</span>T<span style="color:#f92672">.</span>to_dict()<span style="color:#f92672">.</span>values() )</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>
