reports/climbingWallSPA.org
* Log
  :LOGBOOK:
  CLOCK: [2017-12-01 Fri 23:42]--[2017-12-01 Fri 23:48] =>  0:06
  CLOCK: [2017-12-01 Fri 18:36]--[2017-12-01 Fri 20:37] =>  2:01
  CLOCK: [2017-11-30 Thu 21:36]--[2017-12-01 Fri 18:35] => 20:59
  :END:
 - <2017-11-20 Mon> - color,grade+half,area model<->view connected - 1h
 - <2017-11-29 Wed> - python api (bottle+tinydb), ajax submit, list routes
 - <2017-11-30 Thu> - highlight route on list click, reset input on submit
 - <2017-12-01 Fri> - style, "" instead of null for selection, db summery routes
 - <2017-12-02 Sat> - simpler interface, "user"
 - <2017-12-05 Tue> - add green to colors, textbox for set_date

*** DONE [#A] integrate summary with display
    :LOGBOOK:
    CLOCK: [2017-12-02 Sat 09:15]--[2017-12-02 Sat 09:47] =>  0:32
    :END:
*** TODO [#A] filter summary color/grade/area
    :LOGBOOK:
    CLOCK: [2017-12-02 Sat 10:30]--[2017-12-02 Sat 12:12] =>  1:42
    CLOCK: [2017-12-02 Sat 09:57]--[2017-12-02 Sat 10:25] =>  0:28
    :END:
**** TODO [#B] set_date
*** TODO [#B] fix -1=>"B" on span route list click
*** DONE [#B] user
*** TODO [#C] different locations
*** DONE location summary 
*** DONE add edit: notes, rate, name, setter
*** TODO [#C] remove routes/reset wall
