hugo/public/climbingwallspa/index.html
<div id="outline-container-headline-18" class="outline-2">
<h2 id="headline-18">
Log
</h2>
<div id="outline-text-headline-18" class="outline-text-2">
<p>CLOCK: [2017-12-01 Fri 23:42][2017-12-01 Fri 23:48] =&gt;  0:06
  CLOCK: [2017-12-01 Fri 18:36][2017-12-01 Fri 20:37] =&gt;  2:01
  CLOCK: [2017-11-30 Thu 21:36][2017-12-01 Fri 18:35] =&gt; 20:59</p>
<ul>
<li><span class="timestamp">&lt;2017-11-20 Mon&gt;</span> - color,grade+half,area model&lt;-&gt;view connected - 1h</li>
<li><span class="timestamp">&lt;2017-11-29 Wed&gt;</span> - python api (bottle+tinydb), ajax submit, list routes</li>
<li><span class="timestamp">&lt;2017-11-30 Thu&gt;</span> - highlight route on list click, reset input on submit</li>
<li><span class="timestamp">&lt;2017-12-01 Fri&gt;</span> - style, &#34;&#34; instead of null for selection, db summery routes</li>
<li><span class="timestamp">&lt;2017-12-02 Sat&gt;</span> - simpler interface, &#34;user&#34;</li>
<li><span class="timestamp">&lt;2017-12-05 Tue&gt;</span> - add green to colors, textbox for set_date</li>
</ul>
<div id="outline-container-headline-19" class="outline-4">
<h4 id="headline-19">
<span class="todo">DONE</span>
<span class="priority">[A]</span>
integrate summary with display
</h4>
<div id="outline-text-headline-19" class="outline-text-4">
<p>CLOCK: [2017-12-02 Sat 09:15][2017-12-02 Sat 09:47] =&gt;  0:32</p>
</div>
</div>
<div id="outline-container-headline-20" class="outline-4">
<h4 id="headline-20">
<span class="todo">TODO</span>
<span class="priority">[A]</span>
filter summary color/grade/area
</h4>
<div id="outline-text-headline-20" class="outline-text-4">
<p>CLOCK: [2017-12-02 Sat 10:30][2017-12-02 Sat 12:12] =&gt;  1:42
    CLOCK: [2017-12-02 Sat 09:57][2017-12-02 Sat 10:25] =&gt;  0:28</p>
<div id="outline-container-headline-21" class="outline-5">
<h5 id="headline-21">
<span class="todo">TODO</span>
<span class="priority">[B]</span>
set_date
</h5>
</div>
</div>
</div>
<div id="outline-container-headline-22" class="outline-4">
<h4 id="headline-22">
<span class="todo">TODO</span>
<span class="priority">[B]</span>
fix -1=&gt;&#34;B&#34; on span route list click
</h4>
</div>
<div id="outline-container-headline-23" class="outline-4">
<h4 id="headline-23">
<span class="todo">DONE</span>
<span class="priority">[B]</span>
user
</h4>
</div>
<div id="outline-container-headline-24" class="outline-4">
<h4 id="headline-24">
<span class="todo">TODO</span>
<span class="priority">[C]</span>
different locations
</h4>
</div>
<div id="outline-container-headline-25" class="outline-4">
<h4 id="headline-25">
<span class="todo">DONE</span>
location summary 
</h4>
</div>
<div id="outline-container-headline-26" class="outline-4">
<h4 id="headline-26">
<span class="todo">DONE</span>
add edit: notes, rate, name, setter
</h4>
</div>
<div id="outline-container-headline-27" class="outline-4">
<h4 id="headline-27">
<span class="todo">TODO</span>
<span class="priority">[C]</span>
remove routes/reset wall
</h4>
</div>
</div>
</div>

      
    </div>
</body>
</html>
